GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_dacs.c
// 08/31/15 - Blows up when try to Enable/Start the DACs with HAL_DAC_Start_DMA
//              ==> DMA not properly setup or DAC/DMA Clocks not on, or Rupt Handler not setup ...
//*******1*********2*********3*********4*********5*********6*********7**********
//
//                           board_STM32_dacs.c
//
//
//  Common Logic for DAC support for STM32 MCUs.
//
//  The following MCUs with built-in DACs are supported:
//        - F0  72,  91
//        - F3  03,  34    (F3_34 has a 2nd DAC2 using PA6/DAC2_OUT1)
//        - F4  46
//        - F7  46
//        - L0  53         (1 channel, PA4 only)
//        - L1  52
//        - L4  76
//
//  All STM32's use the following fixed DAC outputs:
//        Channel_1 = PA4  (DAC_OUT1)     Arduino Header A2
//        Channel_2 = PA5  (DAC_OUT2)     Arduino Header D13
//
//  Uses a combination of HAL_Library (mostly for configuration) and direct
//  register calls (main execution).
//
//  Specific chip dependences are mainly constrained to tables (GPIOs used
//  specific DAC modules supported, etc). They are pulled in as #includes
//  based MCU type.
//
//  In general, the use of #ifdefs within the code has been minimized, in
//  order to keep things read-able and maintainable.
//
//  History:
//    12/30/14 - Created for Industrial IoT OpenSource project.  Duq
//    06/08/15 - Integrate in ADC, PWM, CRC changes to match rest of STM32 bds.
//    07/31/15 - Reworked to provide better factoring for DAC support. Duq
// -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -
//
// The MIT License (MIT)
//
// Copyright (c) 2014-2015 Wayne Duquaine / Grandview Systems
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
// 
// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.
// 
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
// THE SOFTWARE.
//*****************************************************************************

#include "user_api.h"
#include <math.h>

     //---------------------------------------------------------
     // Global Defines needed by DAC support
     //---------------------------------------------------------

typedef struct dac_channel_def        /* ADC Channel definitions */
    {
        GPIO_TypeDef *chan_gpio_port; /* Associated GPIO port                 */
        uint32_t     chan_gpio_pin;   /* Associated GPIO pin                  */
        uint16_t     chan_dac_id;     /* HAL Logical Channel id for this chan */
#if defined(STM32F446xx) || defined(STM32F746xx)
        DMA_Stream_TypeDef  *chan_dma_stream;      /* DMA stream to use       */
        uint32_t            chan_dma_subchannel;   /* DMA sub-channel to use  */
#else
        DMA_Channel_TypeDef *chan_dma_subchannel;  /* DMA sub-channel to use  */
#endif
        DAC_TypeDef         *chan_dac_module;      /* DAC Module to use       */
    } DAC_CHANNEL_BLK;

typedef struct dac_trigger_def             /* DAC Trigger definitions */
    {
        uint16_t     trigger_user_api_id;  /* User API id for the trigger */
        uint16_t     trigger_tmr_mmsmask;  /* Associated Mask for TIM MMS */
        uint32_t     trigger_dac_tselmask; /* Associated Mask for DAC TSEL*/
    } DAC_TRIGGER_BLK;


// move the following to boarddef.h at some point
int  board_dac_check_conversions_done (int dac_module_id, int sequencer);
int  board_dac_clear_conversions_done (int dac_module_id, int sequencer);
int  board_dac_SineWave (int dac_module_id, int channel_num, long hz_frequency, long sps, int flags);
int  board_dac_Trianglewave (int dac_module_id, int channel_num, long hz_frequency, long sps, int flags);
int  board_dac_SquareWave  (int dac_module_id, int channel_num, long hz_frequency, long sps, int flags);
int  board_timerpwm_channel_lookup (int chan_id, int *chan_index);
int  board_timerpwm_enable_clock (int module_id);
long board_timerpwm_compute_prescalar (long period_val);
int  board_timerpwm_config_gpios (void *pwmblkp, int chan_id);

     //----------------------------------------
     //        Function Prototype refs
     //           internal use only
     //----------------------------------------
void  board_error_handler(void);
void  board_dac_enable_clocks (int module_id);
DAC_CHANNEL_BLK  *board_dac_get_channel_block (int module_id, int channel_num);
DAC_TRIGGER_BLK  *board_dac_get_trigger_block (int module_id, int trigger_type);


     //------------------------------------------------------------------------
     //
     // Pull in        MCU dependent GPIO / TIM tables and #defines
     //
     // The top of each module include key defines for:
     //          MAX_TIMERS,
     //          TMRPWM_NUM_MODULES
     //          TMRPWM_MAX_CHANNELS
     //
     // The following tables are pulled in:
     //          _g_timer_module_base[]       table/array
     //          _g_TIMx_TimPwmHandle's
     //          _g_timer_typedef_handle[]    table/array
     //          _g_TMPWM_IRQ_table[]         table/array
     //          _g_timer_base_channel_num[]  table/array
     //          _g_tmrpwm_mod_x_channels []  set of tables/arrays for GPIOs
     //          _g_tmrpwm_mod_channel_blk_lookup []    table/array
     //
     // Also, the following two utility routines are included in those files:
     //        - board_timerpwm_compute_prescalar()  because that is MCU speed
     //                                              and clock specific
     //        - board_timerpwm_enable_clock()       because which Timers are
     //                                              supported and the logic to
     //                                              start them is MCU specific
     //------------------------------------------------------------------------

#if defined(STM32F072xB)
//                                         STM32 - F072  Nucleo
#include "STM32_F0/board_F0_tables_dac.c"

#define  DAC_CHAN_1_DMA_CHANNEL        DMA1_Channel3
#define  DAC_CHAN_2_DMA_CHANNEL        DMA1_Channel4
#define  DAC_CHAN_1_DMA_ISR_IRQHandler DMA1_Channel2_3_IRQHandler
#define  DAC_CHAN_2_DMA_ISR_IRQHandler DMA1_Channel4_5_IRQHandler
#define  DAC_CHAN_1_NVIC_IRQn          DMA1_Channel2_3_IRQn
#define  DAC_CHAN_2_NVIC_IRQn          DMA1_Channel4_5_IRQn
#define  DAC_SINGLE_MODULE             1
#define  GPIO_SET_ANALOG_MODE          GPIO_MODE_ANALOG
  #ifndef  DAC1
  #define  DAC1      DAC
  #endif
#endif



