GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_dacs.c
#if defined(STM32F091xC)
//                                         STM32 - F091  Nucleo
#include "STM32_F0/board_F0_tables_dac.c"

#define  DAC_CHAN_1_DMA_CHANNEL        DMA1_Channel3
#define  DAC_CHAN_2_DMA_CHANNEL        DMA1_Channel4
#define  DAC_CHAN_1_DMA_ISR_IRQHandler DMA1_Channel2_3_IRQHandler
#define  DAC_CHAN_2_DMA_ISR_IRQHandler DMA1_Channel4_5_IRQHandler
#define  DAC_CHAN_1_NVIC_IRQn          DMA1_Channel2_3_IRQn
#define  DAC_CHAN_2_NVIC_IRQn          DMA1_Channel4_5_IRQn
#define  DAC_SINGLE_MODULE             1
#define  GPIO_SET_ANALOG_MODE          GPIO_MODE_ANALOG
  #ifndef  DAC1
  #define  DAC1      DAC
  #endif
#endif


#if defined(STM32F303xE) || defined(STM32F303xC)
//                                         STM32 - F303  Nucleo and Discovery
#include "STM32_F3/board_F303_tables_dac.c"

#define  DAC_CHAN_1_DMA_CHANNEL        DMA1_Channel3
#define  DAC_CHAN_2_DMA_CHANNEL        DMA1_Channel4
#define  DAC_CHAN_1_DMA_ISR_IRQHandler DMA1_Channel3_IRQHandler
#define  DAC_CHAN_2_DMA_ISR_IRQHandler DMA1_Channel4_IRQHandler
#define  DAC_CHAN_1_NVIC_IRQn          DMA1_Channel3_IRQn
#define  DAC_CHAN_2_NVIC_IRQn          DMA1_Channel4_IRQn
#define  DAC_SINGLE_MODULE             1
#define  GPIO_SET_ANALOG_MODE          GPIO_MODE_ANALOG
#endif


#if defined(STM32F334x8)
//                                         STM32 - F334  Nucleo and Discovery
#include "STM32_F3/board_F334_tables_dac.c"

#define  DAC_CHAN_1_DMA_CHANNEL        DMA1_Channel3
#define  DAC_CHAN_2_DMA_CHANNEL        DMA1_Channel4

#define  DAC_CHAN_1_DMA_ISR_IRQHandler DMA1_Channel3_IRQHandler
#define  DAC_CHAN_2_DMA_ISR_IRQHandler DMA1_Channel4_IRQHandler
#define  DAC_CHAN_1_NVIC_IRQn          DMA1_Channel3_IRQn
#define  DAC_CHAN_2_NVIC_IRQn          DMA1_Channel4_IRQn

#define  DAC_SINGLE_MODULE             1
#define  GPIO_SET_ANALOG_MODE          GPIO_MODE_ANALOG
#endif


#if defined(STM32F446xx)
//                                         STM32 - F446  Nucleo
#include "STM32_F4/board_F446_tables_dac.c"

#define  DAC_CHAN_1_DMA_CHANNEL        DMA_CHANNEL_7
#define  DAC_CHAN_2_DMA_CHANNEL        DMA_CHANNEL_8
#define  DAC_CHAN_1_DMA_ISR_IRQHandler DMA1_Stream5_IRQHandler
#define  DAC_CHAN_2_DMA_ISR_IRQHandler DMA1_Stream6_IRQHandler
#define  DAC_CHAN_1_NVIC_IRQn          DMA1_Stream5_IRQn
#define  DAC_CHAN_2_NVIC_IRQn          DMA1_Stream6_IRQn
#define  DAC_SINGLE_MODULE             1
#define  GPIO_SET_ANALOG_MODE          GPIO_MODE_ANALOG
  #ifndef  DAC1
  #define  DAC1      DAC
  #endif
#endif


#if defined(STM32F746xx) || defined(STM32F746NGHx)
//                                         STM32 - F746  Discovery
#include "STM32_F7/board_F7_tables_dac.c"

#define  DAC_CHAN_1_DMA_CHANNEL        DMA_CHANNEL_7
#define  DAC_CHAN_2_DMA_CHANNEL        DMA_CHANNEL_8
#define  DAC_CHAN_1_DMA_ISR_IRQHandler DMA1_Stream5_IRQHandler
#define  DAC_CHAN_2_DMA_ISR_IRQHandler DMA1_Stream6_IRQHandler
#define  DAC_CHAN_1_NVIC_IRQn          DMA1_Stream5_IRQn
#define  DAC_CHAN_2_NVIC_IRQn          DMA1_Stream6_IRQn
#define  DAC_SINGLE_MODULE             1
#define  GPIO_SET_ANALOG_MODE          GPIO_MODE_ANALOG
  #ifndef  DAC1
  #define  DAC1      DAC
  #endif
#endif


#if defined(STM32L053xx)
//                                         STM32 - L053  Nucleo and Discovery
#include "STM32_L0/board_L0_tables_dac.c"

#define  DAC_CHAN_1_DMA_REQUEST_ID     DMA_REQUEST_9
#define  DAC_CHAN_1_DMA_CHANNEL        DMA1_Channel2
#define  DAC_CHAN_1_DMA_ISR_IRQHandler DMA1_Channel2_3_IRQHandler
#define  DAC_CHAN_1_NVIC_IRQn          DMA1_Channel2_3_IRQn
#define  DAC_SINGLE_MODULE             1
#define  DAC_SINGLE_CHANNEL_ONLY       1
#define  GPIO_SET_ANALOG_MODE          GPIO_MODE_ANALOG
  #ifndef  DAC1
  #define  DAC1      DAC
  #endif
#endif


#if defined(STM32L152xE) || defined(STM32L152xC)
//                                         STM32 - L152  Nucleo and Discovery
#include "STM32_L1/board_L1_tables_dac.c"

#define  DAC_CHAN_1_DMA_CHANNEL        DMA1_Channel3
#define  DAC_CHAN_2_DMA_CHANNEL        DMA1_Channel4
#define  DAC_CHAN_1_DMA_ISR_IRQHandler DMA1_Channel3_IRQHandler
#define  DAC_CHAN_2_DMA_ISR_IRQHandler DMA1_Channel4_IRQHandler
#define  DAC_CHAN_1_NVIC_IRQn          DMA1_Channel3_IRQn
#define  DAC_CHAN_2_NVIC_IRQn          DMA1_Channel4_IRQn
#define  DAC_SINGLE_MODULE             1
#define  GPIO_SET_ANALOG_MODE          GPIO_MODE_ANALOG
  #ifndef  DAC1
  #define  DAC1      DAC
  #endif
#endif


#if defined(STM32L476xx)
//                                         STM32 - L476  Nucleo and Discovery
#include "STM32_L4/board_L4_tables_dac.c"

//#define  DAC_CHAN_1_DMA_CHANNEL        DMA1_Channel3
//#define  DAC_CHAN_2_DMA_CHANNEL        DMA1_Channel4
#define  DAC_CHAN_1_DMA_ISR_IRQHandler DMA1_Channel3_IRQHandler  // verified 08/28
#define  DAC_CHAN_2_DMA_ISR_IRQHandler DMA1_Channel4_IRQHandler
#define  DAC_CHAN_1_NVIC_IRQn          DMA1_Channel3_IRQn
#define  DAC_CHAN_2_NVIC_IRQn          DMA1_Channel4_IRQn
#define  DAC_SINGLE_MODULE             1
#define  GPIO_SET_ANALOG_MODE          GPIO_MODE_ANALOG
void  DMA1_Channel3_IRQHandler (void);               // DAC DMA ISR - Channel 1
void  DMA1_Channel4_IRQHandler (void);               // DAC DMA ISR - Channel 2
#endif



//*****************************************************************************
//*****************************************************************************
//                      COMMON   TABLES  and  DEFINEs
//
//                               for
//
//                            DAC  Support
//*****************************************************************************
//*****************************************************************************

#if defined(DAC2)
                               //---------------------------------------
                               //  Two  DAC  Modules  (e.g. F3_34)
                               //---------------------------------------
    DAC_HandleTypeDef      _g_DacHandle_1;     // Master handle for DAC1 module
    DAC_HandleTypeDef      _g_DacHandle_2;     // Master handle for DAC2 module

    DAC_ChannelConfTypeDef _g_Dac_Chan_Config_1;         // DAC channel 1 I/O
    DMA_HandleTypeDef      _g_DMA_dac_ch1;               // DAC channel 1 DMA

    DAC_ChannelConfTypeDef _g_Dac_Chan_Config_2;         // DAC channel 2 I/O
    DMA_HandleTypeDef      _g_DMA_dac_ch2;               // DAC channel 2 DMA

    DAC_ChannelConfTypeDef _g_Dac_Chan_Config_3;         // DAC channel 3 I/O
    DMA_HandleTypeDef      _g_DMA_dac_ch3;               // DAC channel 3 DMA

const  DAC_ChannelConfTypeDef  *_g_dac_channel_handle [] =
                                  { 0L,
                                    &_g_Dac_Chan_Config_1,
                                    &_g_Dac_Chan_Config_2,
                                    &_g_Dac_Chan_Config_3
                                  };

