GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_dacs.c
const  DMA_HandleTypeDef  *_g_dac_dma_handle [] =
                                  { 0L,
                                    &_g_DMA_dac_ch1,
                                    &_g_DMA_dac_ch2,
                                    &_g_DMA_dac_ch3
                                  };

    uint32_t               _g_DMA_dac_ch1_rupt_seen = 0;         // DEBUG COUNTER
    uint32_t               _g_DMA_dac_ch2_rupt_seen = 0;         // DEBUG COUNTER
    uint32_t               _g_DMA_dac_ch3_rupt_seen = 0;         // DEBUG COUNTER
#else
    DAC_HandleTypeDef      _g_DacHandle_1;       // Master handle for DAC module

    DAC_ChannelConfTypeDef _g_Dac_Chan_Config_1;         // DAC channel 1 I/O
    DMA_HandleTypeDef      _g_DMA_dac_ch1;               // DAC channel 1 DMA

    DAC_ChannelConfTypeDef _g_Dac_Chan_Config_2;         // DAC channel 2 I/O
    DMA_HandleTypeDef      _g_DMA_dac_ch2;               // DAC channel 2 DMA

const  DAC_ChannelConfTypeDef  *_g_dac_channel_handle [] =
                                  { 0L,
                                    &_g_Dac_Chan_Config_1,
                                    &_g_Dac_Chan_Config_2,
                                  };

const  DMA_HandleTypeDef  *_g_dac_dma_handle [] =
                                  { 0L,
                                    &_g_DMA_dac_ch1,
                                    &_g_DMA_dac_ch2,
                                  };

    uint32_t               _g_DMA_dac_ch1_rupt_seen = 0;         // DEBUG COUNTER
    uint32_t               _g_DMA_dac_ch2_rupt_seen = 0;         // DEBUG COUNTER
#endif

                      //-------------------------------------------------
                      //    DAC  Channel 1    Status and Config Flags
                      //-------------------------------------------------
    char        _g_DMA_DAC_Ch1_complete = 0; // status: 1 = DAC and DMA completed
    long        _g_dac_chan_1_frequency = 0; // SPS frequency for DAC Channel 1
    short       *_g_dac_chan_1_table;        // pointer to sample table for chan 1
    int         _g_dac_chan_1_table_length=0;// length of sample table (steps)

    uint16_t    _g_trigger_dtmr_mmsmask_1 = 0; // Chan 1 Associated Mask for TIM's  MMS
    uint16_t    _g_trigger_duser_api_id_1 = 0; //   "    Associated DAC trigger type

                      //-------------------------------------------------
                      //    DAC  Channel 2    Status and Config Flags
                      //-------------------------------------------------
    char        _g_DMA_DAC_Ch2_complete = 0; // status: 1 = DAC and DMA completed
    long        _g_dac_chan_2_frequency = 0; // SPS frequency for DAC Channel 2
    short       *_g_dac_chan_2_table;        // pointer to sample table for chan 2
    int         _g_dac_chan_2_table_length=0;// length of sample table (steps)

    uint16_t    _g_trigger_dtmr_mmsmask_2 = 0; // Chan 2 Associated Mask for TIM's  MMS
    uint16_t    _g_trigger_duser_api_id_2 = 0; //   "    Associated DAC trigger type

    int         _g_dac_init_error         = 0; // Saved error code from HAL_DAC_Init()
    int         _g_dac_chan_config_error  = 0; // Saved error code from HAL_DAC_ConfigChannel()
    int         _g_dac_start_error        = 0; // Saved error code from HAL_DAC_Start_DMA()

#define  pi     3.141592654
    float       _g_pi_div_180 = pi / 180.0;    // get radians ratio to degrees

                                               // generic proptotypes
void  DAC_CHAN_1_DMA_ISR_IRQHandler (void);          // DAC DMA ISR - Channel 1
void  DAC_CHAN_2_DMA_ISR_IRQHandler (void);          // DAC DMA ISR - Channel 2
void  DAC_CHAN_3_DMA_ISR_IRQHandler (void);          // DAC DMA ISR - Channel 3


//*****************************************************************************
//*****************************************************************************
//                               DAC   Routines
//
//                     COMMON CODE  -  GENERATE WAVEFORMS
//
//                     Used by built-in DACs and External DACs
//*****************************************************************************
//*****************************************************************************

//*****************************************************************************
//  board_dac_gen_sample_table
//
//          Generate a wave form table, with a given number of steps
//
//         Valid wave_types are:    DAC_GEN_SINEWAVE     DAC_GEN_SAWTOOTH
//                                  DAC_GEN_TRIANGLE     DAC_GEN_SQUAREWAVE
//
//*****************************************************************************

//  ??? include an amplitude factor/multiplier in here or in  dac_enable_channel() ???

//  ??? in future, allow a DC_Offset and max amplitude option for nore flexibility
//      ex: sine wave requires an implicit offset to get top/bottom of sinewave right.

int  board_dac_gen_sample_table (unsigned int wave_type, short *table_buf, int num_steps)
{
    int    i,  halfway_point;
    short  tbl_value;
    float  increment,  dc_offset_value,  curr_value;
    float  degree,  radians,  sine_val;
    float  degree_increment;

    if (wave_type < DAC_GEN_SINEWAVE || wave_type > DAC_GEN_SQUAREWAVE)
       return (-1);     // set APPROP ERROR CODE  ??? !!!
    if (num_steps < 2)
       return (-1);     // set APPROP ERROR CODE  ??? !!!

    halfway_point = (num_steps >> 1);           // divide by 2 to get halfway point
    curr_value = 0.0;                           // starting value
    switch (wave_type)
      { case DAC_GEN_SINEWAVE:          // standard sinewave, 1 cycle, 0 to 2 pi (360 degrees)
                  degree_increment = (360.0 / (float) num_steps); // how much each step is worth
                  degree = 0.0;                          // starting value (0 degrees)
                     // to get a "centered" sinewave, we need to add a DC offset,
                     // so that the top half is from 2048 -> 4095 -> 2048, and
                     // the bottom half is 2047 -> 0 -> 2047
                  dc_offset_value = 2047.0;
                  for (i = 0;  i < num_steps; i++)
                    { radians  = degree * _g_pi_div_180; // convert degrees to radians
                      sine_val = sin (radians);          // get associated sine value 0.0 to 1.0
//                    curr_value   = sine_val * 4095.0;  // convert to 0 - 4095 range
                      curr_value   = sine_val * dc_offset_value;
                      if (i < halfway_point)
                         {     // process top half of sine wave: 2047 -> 4095 -> 2047
                           tbl_value = ((short) curr_value);  // convert to int
                           if (tbl_value > 2048)
                              tbl_value = 2048;               // handle any float->int round off that would cause us to creep above 4095
                           table_buf[i] = tbl_value + 2047;   // add DC offset
                         }
                        else
                         {     // process bottom half of sine wave: 2047 -> 0 -> 2047
                               // sine_values at this point will all be negative
                           tbl_value = ((short) curr_value);  // convert to int
                           if (tbl_value < -2047)
                              tbl_value = -2047;              // handle any float->int round off that would cause us to creep below -2047
                           table_buf[i] = tbl_value + 2047;   // add DC offset
                         }
                      degree += degree_increment;        // step to next increment step
                    }
                  break;

        case DAC_GEN_SAWTOOTH:          // linear rising sawtooth, then drops to 0
///               for (i = 0;  i < 4095; i++)    // simple minded 1 tick per SPS point
///                  table_buf[i] = i;
                      // use float to minimize integer round-off issues.
                      // we calculate full scale 12 bits (4096), and apply amplitude later.
                  increment  = (4095.0 / (float) num_steps);  // how much each step is worth
                  for (i = 0;  i < num_steps; i++)
                    { table_buf[i] = (short) curr_value;  // convert to int
                      curr_value  += increment;           // step linearly to next value
                    }
                  break;

        case DAC_GEN_TRIANGLE :        // symmetric triangle centered at middle
                     // technically, a sawtooth is set of odd harmonic sine values,
                     // but a cheap way to calculate is to treat it as a rising linear
                     // ramp for the first 1/2 period, and a declining linjear ramp for
                     // the second half period.
                  increment  = (4095.0 / (float) halfway_point);  // how much each step is worth
                  for (i = 0;  i < halfway_point; i++)
                    {    // first half of period = linear rising
                      table_buf[i] = (short) curr_value;  // convert to int
                      curr_value  += increment;           // step up linearly to next value
                    }
                  for (i = halfway_point;  i < num_steps; i++)
                    {    // second half of period = linear declining
                      curr_value  -= increment;           // step down linearly to next value
                      table_buf[i] = (short) curr_value;  // convert to int
                      if (table_buf[i] < 0)
                         table_buf[i] = 0;                // clean up last value in case just dip below 0
                    }
                  break;

        case DAC_GEN_SQUAREWAVE:       // square wave = simple 50% on, 50 % off
                  for (i = 0; i < halfway_point; i++)
                     table_buf[i] = 0;                    // first half of table is zeros
                  for (i = halfway_point; i < num_steps; i++)
                     table_buf[i] = 4095;                 // second half of table is max
                  break;
      }

    return (0);               // denote completed successfully
}



//*****************************************************************************
//*****************************************************************************
//                               DAC   Routines
//
//                         SUPPORT  for  BUILT-IN  DACs
//
//
//*****************************************************************************
//*****************************************************************************


//*****************************************************************************
//  board_dac_init
//
//         Initialize a DAC module, and Configure
//         the overall sampling clock used for the DAC channels on a module.
//
//         The default is set to XXXX.
//         This call allows an experienced programmer to override that default.
//*****************************************************************************

int  board_dac_init (unsigned int dac_module_id, uint32_t clock_rate, int flags)
{
    int                rc;
    DAC_HandleTypeDef  *dacHandle;

#if defined(DAC2)
    if (dac_module_id == DACM2)
       { memset (&_g_DacHandle_2, 0, sizeof(_g_DacHandle_2));   // clear struct
         _g_DacHandle_2.Instance = DAC2;
         dacHandle = & _g_DacHandle_2;
       }
       else { memset (&_g_DacHandle_1, 0, sizeof(_g_DacHandle_1)); // clear struct
              _g_DacHandle_1.Instance = DAC1;
              dacHandle = & _g_DacHandle_1;
            }
#else
    memset (&_g_DacHandle_1, 0, sizeof(_g_DacHandle_1));  // clear struct

    _g_DacHandle_1.Instance = DAC1;   // Most STM32s have just a single DAC module
    dacHandle = &_g_DacHandle_1;
#endif

    board_dac_enable_clocks (dac_module_id);

    rc = HAL_DAC_Init (dacHandle);
    if (rc != HAL_OK)
       { _g_dac_init_error = rc;
         return (ERR_DAC_INITIALIZIATION_ERROR);    /* Initiliazation Error */
       }
    return (0);
}


//*****************************************************************************
//  board_dac_config_channel
//
//        Configure a single DAC channel.
//
//        Note that the sampling rate will be determined by the trigger source.
//
//        adc_module parm is really just an index number (0-3)
//        that denote which ADC module to use.
//        For the STM32 F4, there is only 1 ADC module: DAC1
//
//        trigger_type specifies the type of trigger that will be used
//           - User App
//           - Timer
//           - GPIO EXTI
//
//        The flags value is passed to denote:
//           - priority 0-3                            (NOW)
//           - if interrupts and/or DMA should be used (FUTURE UPGRADE)
//           - Comparator and/or Reference used        (FUTURE_UPGRAGDE)
//
//        STM32 built-in DAC logic supports 1 DAC module with two channels,
//        that are on dedicated pins:  Channel_1 = PA4 (DAC_OUT1)   Arduino A2
//                                     Channel_2 = PA5 (DAC_OUT2)   Arduino D13
//*****************************************************************************

int  board_dac_config_channel (unsigned int dac_module_id, int channel_num,
                               int trigger_type,
                               long sps_frequency, int flags)

{
    DAC_CHANNEL_BLK         *chan_blkp;
    DAC_TRIGGER_BLK         *trigblk;
    DAC_ChannelConfTypeDef  *dac_chan_handle;
    DMA_HandleTypeDef       *dac_dma_ptr;
    GPIO_InitTypeDef        GPIO_InitStruct;
    int                     rc;

    memset (&GPIO_InitStruct, 0, sizeof(GPIO_InitStruct));  // clear struct

       // there is only 1 DAC module on the each of the supported STM32s,
       // so for now  we ignore the module id

       // verify channel number is valid
    if (channel_num == DAC_CHAN_1  ||  channel_num == DAC_CHAN_2)
       ;
      else return (ERR_DAC_CHANNEL_NUM_OUT_OF_RANGE);

