GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_dacs.c
       //---------------------------------------------------------
       //                   Trigger Support
       //
       // Lookup and Save needed information for Trigger support.
       // This will be used at dac_Enable() time to turn on
       // the triggering that will be used by the DAC channel.
       //---------------------------------------------------------
    trigblk = (DAC_TRIGGER_BLK*) board_dac_get_trigger_block (dac_module_id,
                                                              trigger_type);
    if (trigblk == 0)
       return (ERR_DAC_UNSUPPORTED_TRIGGER_TYPE);

       //-------------------------------------------------------
       //        GPIO  Configuration  for  DAC  Channel
       //-------------------------------------------------------
    chan_blkp = (DAC_CHANNEL_BLK*) board_dac_get_channel_block (dac_module_id,
                                                                channel_num);
    GPIO_InitStruct.Pin  = chan_blkp->chan_gpio_pin;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;         // tag it as Analog
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init (chan_blkp->chan_gpio_port, &GPIO_InitStruct);

    if (channel_num == DAC_CHAN_1)
       {         // DAC Channel1: save operational parms
         _g_dac_chan_1_frequency  = sps_frequency; // save SPS frequency for this DAC
         _g_trigger_dtmr_mmsmask_1 = trigblk->trigger_tmr_mmsmask;  // save Mask for TIM's  MMS
         _g_trigger_duser_api_id_1 = trigger_type; // save associated DAC trigger type
       }
      else {     // DAC Channel2: save operational parms
             _g_dac_chan_2_frequency  = sps_frequency; // save SPS freq for this DAC
             _g_trigger_dtmr_mmsmask_2 =  trigblk->trigger_tmr_mmsmask;  // save Mask for TIM's  MMS
             _g_trigger_duser_api_id_2 = trigger_type; // save associated DAC trigger
           }

              //-----------------------------------------------------------------
              // get pointers to DAC Channel and DAC DMA objects we will be using
              //-----------------------------------------------------------------
    dac_chan_handle = (DAC_ChannelConfTypeDef*) _g_dac_channel_handle [channel_num];
    dac_dma_ptr     = (DMA_HandleTypeDef*) _g_dac_dma_handle [channel_num];

              //-----------------------------------------------------------
              // Setup DAC channel's Configuration
              //-----------------------------------------------------------
    dac_chan_handle->DAC_Trigger      = trigblk->trigger_dac_tselmask; // trigger to use
    dac_chan_handle->DAC_OutputBuffer = DAC_OUTPUTBUFFER_ENABLE;
    rc = HAL_DAC_ConfigChannel (&_g_DacHandle_1, dac_chan_handle, chan_blkp->chan_dac_id);

    if (rc != HAL_OK)
       { _g_dac_chan_config_error = rc;
         return (ERR_DAC_CHANNEL_CONFIG_ERROR);   // Channel configuration Error
       }

              //-----------------------------------------------------------
              // Setup DAC's DMA Configuration for that channel
              //-----------------------------------------------------------
    memset (dac_dma_ptr, 0, sizeof(DMA_HandleTypeDef));  // clear struct
#if defined(STM32F446xx) || defined(STM32F746xx)
    dac_dma_ptr->Instance     = chan_blkp->chan_dma_stream;    // DMA1_Stream5/6
    dac_dma_ptr->Init.Channel = chan_blkp->chan_dma_subchannel; // DMA_CHANNEL_7
#else
    dac_dma_ptr->Instance     = chan_blkp->chan_dma_subchannel;
#endif
#if defined(DAC_CHAN_1_DMA_REQUEST_ID)
    dac_dma_ptr->Init.Request  = DAC_CHAN_1_DMA_REQUEST_ID;   // L0 special case
#endif
    dac_dma_ptr->Init.Direction           = DMA_MEMORY_TO_PERIPH;
    dac_dma_ptr->Init.PeriphInc           = DMA_PINC_DISABLE;
    dac_dma_ptr->Init.MemInc              = DMA_MINC_ENABLE;
    dac_dma_ptr->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    dac_dma_ptr->Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
    dac_dma_ptr->Init.Mode                = DMA_CIRCULAR;
    dac_dma_ptr->Init.Priority            = DMA_PRIORITY_HIGH;
    rc = HAL_DMA_Init (dac_dma_ptr);
    if (rc != HAL_OK)
       { _g_dac_chan_config_error = rc;
         return (ERR_DAC_CHANNEL_DMA_CONFIG_ERROR);   // Channel configuration Error
       }

             // Associate the initialized DMA handle to the DAC handle
    if (channel_num == DAC_CHAN_1)
       __HAL_LINKDMA (&_g_DacHandle_1, DMA_Handle1, *dac_dma_ptr);   // DAC1 CH1
#if ! defined(DAC_SINGLE_CHANNEL_ONLY)
       else if (channel_num == DAC_CHAN_2)
               __HAL_LINKDMA (&_g_DacHandle_1,DMA_Handle2,*dac_dma_ptr); // DAC1 CH2
#endif
#if defined(DAC_CHAN_3_DMA_CHANNEL)
       else __HAL_LINKDMA (&_g_DacHandle_2, DMA_Handle1, *dac_dma_ptr);  // DAC2
#endif

    return (0);                  // denote worked OK
}


//*****************************************************************************
//  board_dac_check_conversions_completed
//
//          Checks if the ALL the conversions for a sinple DAC are done.
//
//          Returns:
//              True  (1) = Completed
//              False (0) = Busy
//              ERR_DAC_CHANNEL_NUM_OUT_OF_RANGE
//*****************************************************************************
int  board_dac_check_conversions_completed (unsigned int dac_module_id, int channel_num)
{
       // there is only 1 DAC module on the each of the supported STM32s,
       // so for now  we ignore the module id

    if (channel_num == DAC_CHAN_1)
       return (_g_DMA_DAC_Ch1_complete);               // channel 1 status
       else if (channel_num == DAC_CHAN_2)
               return (_g_DMA_DAC_Ch2_complete);       // channel 2 status
       else return (ERR_DAC_CHANNEL_NUM_OUT_OF_RANGE); // invalid channel #
}


//*****************************************************************************
//  board_dac_clear_conversions_completed
//
//          Clears the DAC conversions "completed" flag to setup for next pass.
//
//*****************************************************************************
int  board_dac_clear_conversions_completed (unsigned int dac_module_id, int channel_num)
{
    if (channel_num == DAC_CHAN_1)
       _g_DMA_DAC_Ch1_complete = 0;       // reset channel 1 status for new pass
       else if (channel_num == DAC_CHAN_2)
               _g_DMA_DAC_Ch2_complete = 0;  //    ditto channel 2 status
       else return (ERR_DAC_CHANNEL_NUM_OUT_OF_RANGE); // invalid channel #

    return (0);             // denote worked OK
}


//*****************************************************************************
//  board_dac_disable_channel
//
//          Turn off one of the DAC channels.
//*****************************************************************************
int  board_dac_disable_channel (unsigned int dac_module_id, int channel_num, int flags)
{

