GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_dacs.c
    if (channel_num == DAC_CHAN_1)
       HAL_DAC_Stop (&_g_DacHandle_1, DAC_CHANNEL_1);
#if ! defined(DAC_SINGLE_CHANNEL_ONLY)
       else if (channel_num == DAC_CHAN_2)
               HAL_DAC_Stop (&_g_DacHandle_1, DAC_CHANNEL_2);
#endif
       else return (ERR_DAC_CHANNEL_NUM_OUT_OF_RANGE);

    return (0);                          // denote succeeded
}


//*****************************************************************************
//  board_dac_enable_channel
//
//          Turn on one or all the sequencers that have been configured.
//*****************************************************************************

int  board_dac_enable_channel (unsigned int dac_module_id, int channel_num, int flags)
{
    int   rc;
volatile long  period_ticks;

       // there is only 1 DAC module on the each of the supported STM32s,
       // so for now  we ignore the module id

       //-----------------------------------------------------------------------
       // Convert the frequecy * # steps into a Timer period value dictating when
       // each sample step should be fed into the DAC (via DMA trigger from TIM6)
       //-----------------------------------------------------------------------
    period_ticks = board_frequency_to_period_ticks (_g_dac_chan_1_frequency * _g_dac_chan_1_table_length);

    if (channel_num == DAC_CHAN_1)
       {     //-----------------------------------------------------------------
             // Configure the NVIC interrupt for the DMA used for DAC Channel 1
             //-----------------------------------------------------------------
         HAL_NVIC_SetPriority (DAC_CHAN_1_NVIC_IRQn, 2, 0);
         HAL_NVIC_EnableIRQ (DAC_CHAN_1_NVIC_IRQn);   // will invoke DMA1_Channel2_3_IRQHandler()

             //---------------------------------------------------
             //      Startup up DAC Channel 1 using DMA
             //---------------------------------------------------
// F0 blows up on this when HAL-Lib calls:   08/28/15
//       HAL_DMA_Start_IT (hdac->DMA_Handle1, (uint32_t)pData, tmpreg, Length);
         rc = HAL_DAC_Start_DMA (&_g_DacHandle_1, DAC_CHANNEL_1,
                                 (uint32_t*) _g_dac_chan_1_table,
                                 _g_dac_chan_1_table_length,
                                 DAC_ALIGN_12B_R);
       }
#if ! defined(DAC_SINGLE_CHANNEL_ONLY)
      else if (channel_num == DAC_CHAN_2)
       {     //-----------------------------------------------------------------
             // Configure the NVIC interrupt for the DMA used for DAC Channel 2
             //-----------------------------------------------------------------
         HAL_NVIC_SetPriority (DAC_CHAN_2_NVIC_IRQn, 2, 0);
         HAL_NVIC_EnableIRQ (DAC_CHAN_2_NVIC_IRQn);   // will invoke DMA1_Channel4_5_IRQHandler()

             //---------------------------------------------------
             //      Startup up DAC Channel 2 using DMA
             //---------------------------------------------------
         rc = HAL_DAC_Start_DMA (&_g_DacHandle_1, DAC_CHANNEL_2,
                                 (uint32_t*) _g_dac_chan_2_table,
                                 _g_dac_chan_2_table_length,
                                 DAC_ALIGN_12B_R);
       }
#endif
      else return (ERR_DAC_CHANNEL_NUM_OUT_OF_RANGE);

    if (rc != HAL_OK)
       { _g_dac_start_error = rc;
         return (ERR_DAC_START_ERROR);   // DAC DMA Start Error
       }

    return (0);                          // denote succeeded
}


//*****************************************************************************
//  board_dac_get_app_trigger_masks
//
//          Pass back the trigger related masks that the User App requested
//          via ADC calls.
//          This is invoked by Timer logic to make sure both side are in
//          sync, when board_timerpwm_config_trigger_mode() is called.
//*****************************************************************************

void  board_dac_get_app_trigger_masks (unsigned int dac_channel,
                                       uint16_t *app_trigger_tmr_mmsmask,
                                       uint16_t *app_trigger_user_api_id)
{
#if FUTURE
    DAC_IO_CONTROL_BLK  *dac_blk;

    dac_blk = (DAC_IO_CONTROL_BLK*) board_dac_get_io_control_block (dac_channel);

    *app_trigger_tmr_mmsmask = dac_blk->dac_trigger_tmr_mmsmask;
    *app_trigger_user_api_id = dac_blk->dac_trigger_user_api_id;
#endif
                     if (dac_channel == 1)
                        {    // extract DAC channel 1 trigger parms
                          *app_trigger_tmr_mmsmask = _g_trigger_dtmr_mmsmask_1;
                          *app_trigger_user_api_id = _g_trigger_duser_api_id_1;
                        }
                       else
                        {    // extract DAC channel 2 trigger parms
                          *app_trigger_tmr_mmsmask = _g_trigger_dtmr_mmsmask_2;
                          *app_trigger_user_api_id = _g_trigger_duser_api_id_2;
                        }

}


//*****************************************************************************
//  board_dac_set_sample_table
//
//         Save the sample table address and length to be used for this channel.
//         At channel enable, will feed these into the DMA fot the channel.
//*****************************************************************************
int  board_dac_set_sample_table (unsigned int module_id, int channel_num,
                                 short *table_buf, int num_steps)
{
    if (channel_num == DAC_CHAN_1)
       { _g_dac_chan_1_table = table_buf;
         _g_dac_chan_1_table_length = num_steps;
       }
      else if (channel_num == DAC_CHAN_2)
              { _g_dac_chan_2_table = table_buf;
                _g_dac_chan_2_table_length = num_steps;
              }
      else return (ERR_DAC_CHANNEL_NUM_OUT_OF_RANGE);

    return (0);                 // denote worked OK
}


/**************************************************************************
*                          DMA   DAC  CHANNEL 1   ISR
*
* @brief  This handles the DMA interrupt request for the DAC DMA channel 1
*         DMA1_CHANNEL3.
*         It routes it to the ST HAL library, which does some
*         pre-pcoessing on it, then invokes the associated
*         callback we defined (HAL_ADC_ConvCpltCallback)
*
* @param  None
* @retval None
**************************************************************************/

void  DAC_CHAN_1_DMA_ISR_IRQHandler (void)   // eg DMA1_Channel2_3_IRQHandler
{
    _g_DMA_dac_ch1_rupt_seen++;                           // DEBUG COUNTER

