GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_dacs.c
    _g_DMA_DAC_Ch1_complete = 1; // set status that DAC and DMA completed.
                             // Used by dac_Check_All_Complete() logic.
                             // Alternative option = invoke user callback rtn.

// 09/02/15 - L1 52 testing
//           Somehow, this is causing the ADC_DMA callback handler to be called !!!
//           from the DAC_CHAN_1_DMA_ISR_IRQHandler.
//  ==> are they sharing the same rupt, and we must query which bit is set. ?
//  ==> is causing a severe nested, tight rupt loop. main uis never getting control back.
//  ==> only occurs when turn on DAC support. ADC runs fine otherwise.

    HAL_DMA_IRQHandler (_g_DacHandle_1.DMA_Handle1);  // Call post rupt cleanup
                                                    //   and reset rupt flags
}


#if ! defined(DAC_SINGLE_CHANNEL_ONLY)
/**************************************************************************
*                          DMA   DAC  CHANNEL 2   ISR
*
* @brief  This handles the DMA interrupt request for the DAC DMA channel
*         DMA1_CHANNEL4.
*         It routes it to the ST hAL library, which does some
*         pre-pcoessing on it, then invokes the associated
*         callback we defined (HAL_ADC_ConvCpltCallback)
*
* @param  None
* @retval None
************************************************************************/
void  DAC_CHAN_2_DMA_ISR_IRQHandler (void)   // eg DMA1_Channel4_5_IRQHandler
{
    _g_DMA_dac_ch2_rupt_seen++;                           // DEBUG COUNTER

    _g_DMA_DAC_Ch2_complete = 1; // set status that DAC and DMA completed.
                             // Used by dac_Check_All_Complete() logic.
                             // Alternative option = invoke user callback rtn.


    HAL_DMA_IRQHandler (_g_DacHandle_1.DMA_Handle2);  // Call post rupt cleanup
                                                    //   and reset rupt flags
}
#endif


/******************************************************************************/
